backend/app/services/app/contract_service.rb

    def create
      ::Contract.create!(params)
---
INSERT INTO "contracts" ("created_at", "updated_at", "address") VALUES (?, ?, ?)  [["created_at", "2023-07-04 12:43:19.628059"], ["updated_at", "2023-07-04 12:43:19.628059"], ["address", "0xfCC13bB0D6d5eEE9dCC0995a4582f50b804d63B1"]]