backend/app/services/app/project_service.rb

INSERT INTO "projects" ("created_at", "updated_at", "contract_id", "name", "url", "max_cap_per_investor", "transaction_hash") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      ::Project.create!(params)