backend/app/controllers/contract_controller.rb

  def index
      render json: Contract.last
---
SELECT "contracts".* FROM "contracts" ORDER BY "contracts"."id" DESC LIMIT ?  [["LIMIT", 1]]