backend/app/controllers/project_controller.rb

INSERT INTO "projects" ("name", "url", "max_cap_per_investor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Cat hotel"], ["url", "Pixar"], ["max_cap_per_investor", 12000], ["created_at", "2023-07-03 20:33:22.487457"], ["updated_at", "2023-07-03 20:33:22.487457"]]
---
  def create
     ActiveRecord::Base.transaction do

      project = ::App::ProjectService.new(project_params).create